Data Wrangling - generally refers to transforming raw data into a useable format for your analyses of interest, including loading, aggregating, merging, grouping, concatenating and formatting

Also known as data munging or data preprocessing, is the process of cleaning, structuring,
and transforming raw data into a format suitable for analysis or machine learning.

**1. Data exploration**

In [1]:
#here we assign the data, and then we visualize the data in a tabular
import pandas as pd
data = {
'Name':[ "Allan","Grace","Sebu","Macklin","Joash","Christine","Mike"],
'Age':[25,30,22,28,24,34,19],
'Gender':["male","female","male","female","male","female","male"],
'marks':[85,92,'NaN',88,'NaN',79,80]
}
mydata=pd.DataFrame(data)
(mydata)

C:\Users\King Abubakar\AppData\Local\Temp\ipykernel_2432\3979683001.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

        Name  Age  Gender marks
0      Allan   25    male    85
1      Grace   30  female    92
2       Sebu   22    male   NaN
3    Macklin   28  female    88
4      Joash   24    male   NaN
5  Christine   34  female    79
6       Mike   19    male    80

**2. Dealing with missing values,**

In [2]:
# as we can see from the previous output, thereare NaN values present in the MARKS column.
mydata=pd.DataFrame(data)
print("Original Data")
print(mydata)
row_index=2
column_name="marks"
new_value="88"
mydata.at[row_index,column_name]=new_value
row_index=4
new_value="94"
column_name="marks"
mydata.at[row_index,column_name]=new_value
print("\n modified data")
print(mydata)

Original Data
        Name  Age  Gender marks
0      Allan   25    male    85
1      Grace   30  female    92
2       Sebu   22    male   NaN
3    Macklin   28  female    88
4      Joash   24    male   NaN
5  Christine   34  female    79
6       Mike   19    male    80

 modified data
        Name  Age  Gender marks
0      Allan   25    male    85
1      Grace   30  female    92
2       Sebu   22    male    88
3    Macklin   28  female    88
4      Joash   24    male    94
5  Christine   34  female    79
6       Mike   19    male    80

**3. Reshaping**

replace function () or .map () function from series is used to substitute each value in series with
another value.

In [3]:
#in the GENDER column, we can reshape the data by categorizing them into different numbers.

print("Data type:")
print(mydata['Gender'].dtype)
print("\n Reshaping data(i.e replacing/mapping values)in GENDER COLUMN ")
mydata['Gender']=mydata['Gender'].replace({'female':0.1,'male':0.0})
(mydata)

Data type:
object

 Reshaping data(i.e replacing/mapping values)in GENDER COLUMN

C:\Users\King Abubakar\AppData\Local\Temp\ipykernel_2432\3159720100.py:6: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  mydata['Gender']=mydata['Gender'].replace({'female':0.1,'male':0.0})

        Name  Age  Gender marks
0      Allan   25     0.0    85
1      Grace   30     0.1    92
2       Sebu   22     0.0    88
3    Macklin   28     0.1    88
4      Joash   24     0.0    94
5  Christine   34     0.1    79
6       Mike   19     0.0    80

In [4]:
#ALTERNATIVELY WE CAN USE .MAP FUNCTION
#in the GENDER column, we can reshape the data by categorizing them into different numbers.
import pandas as pd
data = {
'Name':[ "Allan","Grace","Sebu","Macklin","Joash","Christine","Mike"],
'Age':[25,30,22,28,24,34,19],
'Gender':["male","female","male","female","male","female","male"],
'marks':[85,92,'NaN',88,'NaN',79,80]
}
mydata=pd.DataFrame(data)
(mydata)
print("Data type:")
print(mydata['Gender'].dtype)
print("\n Reshaping data(i.e replacing/mapping values)in GENDER COLUMN ")
mydata['Gender']=mydata['Gender'].map({'female':0.1,'male':0.0})
print(mydata)

Data type:
object

 Reshaping data(i.e replacing/mapping values)in GENDER COLUMN
        Name  Age  Gender marks
0      Allan   25     0.0    85
1      Grace   30     0.1    92
2       Sebu   22     0.0   NaN
3    Macklin   28     0.1    88
4      Joash   24     0.0   NaN
5  Christine   34     0.1    79
6       Mike   19     0.0    80

**4. Filtering data**

suppose there is a requirement for the details regarding name, gender,
marks of the top-scoring students. Here we need to remove some unwanted data. *italicized text*

In [5]:
import pandas as pd
import numpy as np

data = {
    'Name': ["Allan", "Grace", "Sebu", "Macklin", "Joash", "Christine", "Mike"],
    'Age': [25, 30, 22, 28, 24, 34, 19],
    'Gender': ["male", "female", "male", "female", "male", "female", "male"],
    'marks': [85, 92, 'NaN', 88, 'NaN', 79, 80]
}

mydata = pd.DataFrame(data)

# Replace 'NaN' strings with actual NaN values
#pd.to_numeric to convert the 'marks' column to numeric values, replacing 'NaN' with actual NaN values. This should resolve the TypeError you were facing during filtering.
mydata['marks'] = pd.to_numeric(mydata['marks'], errors='coerce')

print("Original Data")
print(mydata)

row_index = 2
column_name = "marks"
new_value = 88
mydata.at[row_index, column_name] = new_value

row_index = 4
new_value = 94
column_name = "marks"
mydata.at[row_index, column_name] = new_value

print("\n")
print("\t Modified data")
print(mydata)

print("Data type:")
print(mydata['Gender'].dtype)

print("\nReshaping data (i.e., replacing/mapping values) in GENDER COLUMN")
mydata['Gender'] = mydata['Gender'].map({'female': 0.1, 'male': 0.0})
print(mydata)

print("Filtered Data")
mydata = mydata[mydata['marks'] >= 87]
#axis "0"represents row and axis"1" represents column
mydata = mydata.drop(['Age'], axis=1)
print(mydata)

Original Data
        Name  Age  Gender  marks
0      Allan   25    male   85.0
1      Grace   30  female   92.0
2       Sebu   22    male    NaN
3    Macklin   28  female   88.0
4      Joash   24    male    NaN
5  Christine   34  female   79.0
6       Mike   19    male   80.0


	 Modified data
        Name  Age  Gender  marks
0      Allan   25    male   85.0
1      Grace   30  female   92.0
2       Sebu   22    male   88.0
3    Macklin   28  female   88.0
4      Joash   24    male   94.0
5  Christine   34  female   79.0
6       Mike   19    male   80.0
Data type:
object

Reshaping data (i.e., replacing/mapping values) in GENDER COLUMN
        Name  Age  Gender  marks
0      Allan   25     0.0   85.0
1      Grace   30     0.1   92.0
2       Sebu   22     0.0   88.0
3    Macklin   28     0.1   88.0
4      Joash   24     0.0   94.0
5  Christine   34     0.1   79.0
6       Mike   19     0.0   80.0
Filtered Data
      Name  Gender  marks
1    Grace     0.1   92.0
2     Sebu     0.0   88.0
3  Macklin     0.1   88.0
4    Joash     0.0   94.0

**Retrieving details about 4 top scoring details**

In [6]:
print("Data after filtering marks column(i.e marks>=87)")
print(mydata)
print("Retrieving details about 4 top scoring details")
mydata.sort_values(by='marks',ascending=False,inplace=True)
print(mydata)

Data after filtering marks column(i.e marks>=87)
      Name  Gender  marks
1    Grace     0.1   92.0
2     Sebu     0.0   88.0
3  Macklin     0.1   88.0
4    Joash     0.0   94.0
Retrieving details about 4 top scoring details
      Name  Gender  marks
4    Joash     0.0   94.0
1    Grace     0.1   92.0
2     Sebu     0.0   88.0
3  Macklin     0.1   88.0

Operations that can be used in Data Wranglig:

1.merge operations

2.grouping method

(a) Wrangling Data Using Merge Operation
Syntax:

pd.merge( data_frame1,data_frame2, on="field ")

In [7]:
#First type of Data consists of Details of Students:
import pandas as pd
STUDENTS_DETAILS={
'IDNO':[101,102,103,104,105,106,107,108,109,110],
'NAME':["Peter","Joyce","Phyllis","Moses","Priscillah","Eliud","Veronica","John","Juliet","Clinton"],
'CAMPUS':["Main","Ruiru","Nairobi","Main","Ruiru","Nairobi","Main","Ruiru","Nairobi","Main"],
}
mydata1=pd.DataFrame(STUDENTS_DETAILS)
print(mydata1)

   IDNO        NAME   CAMPUS
0   101       Peter     Main
1   102       Joyce    Ruiru
2   103     Phyllis  Nairobi
3   104       Moses     Main
4   105  Priscillah    Ruiru
5   106       Eliud  Nairobi
6   107    Veronica     Main
7   108        John    Ruiru
8   109      Juliet  Nairobi
9   110     Clinton     Main

In [8]:

#Second type of Data Consist of Pending Fees Status:
import pandas as pd
FEES_DETAILS={
'IDNO':[101,102,103,104,105,106,107,108,109,110],
'PENDING':[6000,375,"NIL",7640,3800,"NIL",1250,900,5200,"NIL"],
}
mydata2=pd.DataFrame(FEES_DETAILS)
print(mydata2)

   IDNO PENDING
0   101    6000
1   102     375
2   103     NIL
3   104    7640
4   105    3800
5   106     NIL
6   107    1250
7   108     900
8   109    5200
9   110     NIL

In [9]:
#Wrangling Data given Using Merge Operation
print("\t MERGED DATA")
mydata=pd.merge(mydata1,mydata2,on="IDNO")
print(mydata)

	 MERGED DATA
   IDNO        NAME   CAMPUS PENDING
0   101       Peter     Main    6000
1   102       Joyce    Ruiru     375
2   103     Phyllis  Nairobi     NIL
3   104       Moses     Main    7640
4   105  Priscillah    Ruiru    3800
5   106       Eliud  Nairobi     NIL
6   107    Veronica     Main    1250
7   108        John    Ruiru     900
8   109      Juliet  Nairobi    5200
9   110     Clinton     Main     NIL

(b) Wrangling Data using Grouping Method

The code below not only
merges the student and fee details but also performs grouping and aggregation to calculate the total
pending fees for each campus.

In [10]:
import pandas as pd
# First type of Data consists of Details of Students:
STUDENTS_DETAILS = {
    'IDNO': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'NAME': ["Peter", "Joyce", "Phyllis", "Moses", "Priscillah", "Eliud", "Veronica", "John", "Juliet", "Clinton"],
    'CAMPUS': ["Main", "Ruiru", "Nairobi", "Main", "Ruiru", "Nairobi", "Main", "Ruiru", "Nairobi", "Main"],
}
mydata1 = pd.DataFrame(STUDENTS_DETAILS)

# Second type of Data Consists of Pending Fees Status:
FEES_DETAILS = {
    'IDNO': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'PENDING': [6000, 375, "NIL", 7640, 3800, "NIL", 1250, 900, 5200, "NIL"],
}
mydata2 = pd.DataFrame(FEES_DETAILS)
# Convert 'PENDING' column to numeric, treating "NIL" as NaN
mydata2['PENDING'] = pd.to_numeric(mydata2['PENDING'],errors='coerce')

# Wrangling Data given Using Merge Operation
mydata = pd.merge(mydata1, mydata2, on="IDNO")
campus_fee_total = mydata.groupby('CAMPUS')['PENDING'].sum().reset_index()
print(campus_fee_total)

    CAMPUS  PENDING
0     Main  14890.0
1  Nairobi   5200.0
2    Ruiru   5075.0

Quiz: There is a Car Selling company and this company have different Brands of
various Car Manufacturing Company like Maruti, Toyota, Mahindra, Ford, etc. and have
data where different cars are sold in different years. So the Company wants to wrangle
only that data where cars are sold during the year 2010. For this problem, we use another
Wrangling technique that is groupby() method.

In [11]:
import pandas as pd
car_data= {
'Brand':["Maruti","Toyota","Mahindra","Ford","Maruti","Toyota","Toyota","Ford","Mahindra","Maruti"],
'Year':[2009,2010,2011,2010,2010,2009,2010,2012,2010,2009],
'Model':['Swift','Corolla','Scorpio','Fiesta','Alto','Camri','Inova','Figo','Bolera','WagonR'],
'Sales':[120,150,95,50,105,130,90,75,85,115],
}
mydata=pd.DataFrame(car_data)
print("\t\tCAR_DATA")
print(mydata)
grouped_data=mydata.groupby('Year')
print(grouped_data)
print("\n")
print("\t\t2010 SALES")
print(grouped_data.get_group(2010))

		CAR_DATA
      Brand  Year    Model  Sales
0    Maruti  2009    Swift    120
1    Toyota  2010  Corolla    150
2  Mahindra  2011  Scorpio     95
3      Ford  2010   Fiesta     50
4    Maruti  2010     Alto    105
5    Toyota  2009    Camri    130
6    Toyota  2010    Inova     90
7      Ford  2012     Figo     75
8  Mahindra  2010   Bolera     85
9    Maruti  2009   WagonR    115
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000184EAF3E060>


		2010 SALES
      Brand  Year    Model  Sales
1    Toyota  2010  Corolla    150
3      Ford  2010   Fiesta     50
4    Maruti  2010     Alto    105
6    Toyota  2010    Inova     90
8  Mahindra  2010   Bolera     85

Using Several years in our Condition:

In [12]:
import pandas as pd

car_data = {
    'Brand': ["Maruti", "Toyota", "Mahindra", "Ford", "Maruti", "Toyota", "Toyota", "Ford", "Mahindra", "Maruti"],
    'Year': [2009, 2010, 2011, 2010, 2010, 2009, 2010, 2012, 2010, 2009],
    'Model': ['Swift', 'Corolla', 'Scorpio', 'Fiesta', 'Alto', 'Camri', 'Inova', 'Figo', 'Bolera', 'WagonR'],
    'Sales': [120, 150, 95, 50, 105, 130, 90, 75, 85, 115],
}

mydata = pd.DataFrame(car_data)
print("\t\tCAR_DATA")
print(mydata)

grouped_data = mydata.groupby('Year')
mychoice = [2009, 2011, 2012]

for year in mychoice:
    print("\n Data for Year{year}")
    print("\n")
    print(grouped_data.get_group(year))

		CAR_DATA
      Brand  Year    Model  Sales
0    Maruti  2009    Swift    120
1    Toyota  2010  Corolla    150
2  Mahindra  2011  Scorpio     95
3      Ford  2010   Fiesta     50
4    Maruti  2010     Alto    105
5    Toyota  2009    Camri    130
6    Toyota  2010    Inova     90
7      Ford  2012     Figo     75
8  Mahindra  2010   Bolera     85
9    Maruti  2009   WagonR    115

 Data for Year{year}


    Brand  Year   Model  Sales
0  Maruti  2009   Swift    120
5  Toyota  2009   Camri    130
9  Maruti  2009  WagonR    115

 Data for Year{year}


      Brand  Year    Model  Sales
2  Mahindra  2011  Scorpio     95

 Data for Year{year}


  Brand  Year Model  Sales
7  Ford  2012  Figo     75

Alternatively, you can use relational operator:

In [13]:
import pandas as pd

car_data = {
    'Brand': ["Maruti", "Toyota", "Mahindra", "Ford", "Maruti", "Toyota", "Toyota", "Ford", "Mahindra", "Maruti"],
    'Year': [2009, 2010, 2011, 2010, 2010, 2009, 2010, 2012, 2010, 2009],
    'Model': ['Swift', 'Corolla', 'Scorpio', 'Fiesta', 'Alto', 'Camri', 'Inova', 'Figo', 'Bolera', 'WagonR'],
    'Sales': [120, 150, 95, 50, 105, 130, 90, 75, 85, 115],
}

mydata = pd.DataFrame(car_data)
print("\t\t 2010 CAR SALES DATA")
sales2010=mydata[mydata['Year']==2010]
print(sales2010)

		 2010 CAR SALES DATA
      Brand  Year    Model  Sales
1    Toyota  2010  Corolla    150
3      Ford  2010   Fiesta     50
4    Maruti  2010     Alto    105
6    Toyota  2010    Inova     90
8  Mahindra  2010   Bolera     85

Using logical Operator & (AND):

In [14]:
import pandas as pd

car_data = {
    'Brand': ["Maruti", "Toyota", "Mahindra", "Ford", "Maruti", "Toyota", "Toyota", "Ford", "Mahindra", "Maruti"],
    'Year': [2009, 2010, 2011, 2010, 2010, 2009, 2010, 2012, 2010, 2009],
    'Model': ['Swift', 'Corolla', 'Scorpio', 'Fiesta', 'Alto', 'Camri', 'Inova', 'Figo', 'Bolera', 'WagonR'],
    'Sales': [120, 150, 95, 50, 105, 130, 90, 75, 85, 115],
}

mydata = pd.DataFrame(car_data)
sales=mydata[(mydata['Year']==2010) & (mydata['Sales']>=100)]
print(sales)

    Brand  Year    Model  Sales
1  Toyota  2010  Corolla    150
4  Maruti  2010     Alto    105